

# ----------------------------------------------------------------------------------------------------------------------
# Создать таблицу
# db_cursor -- курсор для доступа к базе даных
# name -- строка с именем таблицы
# colunms -- строки с именами и типами данных в формате
#       [(n1, t1), (n2, t2), (n3, t3), ...]
def create_table(db_cursor, name, columns):
    sql = 'CREATE TABLE IF NOT EXISTS ' + name\
          + '('\
          + ', '.join((' '.join(c) for c in columns))\
          + ')'
    db_cursor().execute(sql)


# ----------------------------------------------------------------------------------------------------------------------
# Удалить таблицу
# db_cursor -- курсор для доступа к базе даных
# name -- строка с именем таблицы
# colunms -- строки с именами и типами данных в формате
#       [(n1, t1), (n2, t2), (n3, t3), ...]
def delete_table(db_cursor, name):
    db_cursor.execute('DROP TABLE IF EXISTS ' + name)


# ----------------------------------------------------------------------------------------------------------------------
# Создать чистую таблицу (если такая таблица есть -- она предварительно уничтожается)
# db_cursor -- курсор для доступа к базе даных
# name -- строка с именем таблицы
# colunms -- строки с именами и типами данных в формате
#       [(n1, t1), (n2, t2), (n3, t3), ...]
def create_clean_table(db_cursor, name, columns):
    delete_table(db_cursor, name)
    create_table(db_cursor, name, columns)






